//екінші: массивтағы барлық сандардың қосындысын шығару керек
//үшінші: массивтағы сандарды шығара беру керек пока олардың қосындысы 100ден аз болғанша

ar = [2,3,4,5,6,7,8,9,10,12,14,15,16,17,18,19,20,21,22,23,24]; 

function summer(array) { 
    let k = 0; 
    for (let i = 0; i<array.length; i++) {
        k = k+array[i];
        if (k<100) {
            console.log(array[i]);// ж8з болмаганша массивтын элементы шыгады 
        }
    }
    console.log(k);// барлык сандардын косындысы шыгады 
}
summer(ar);