//бесінші: төртінші септей, бірақ егер бір строкада уже k-дан асатын квадрат болса, онда сол строканы шығармай тоқтату керек

// мысалы n = 2, m = 3, k = 20
// [1, 4, 9]
// екінші строкада 25 болғандықтан
//алтыншы: бесінші есептей бірақ строкада k-дан асатын болса онда соған дейінгі сол строкадағы сандарды шығару керек
//мысалы n=2, m=3, k=20
// [1, 4, 9]
// [16]

// let n = 2; 
// let m = 3; 
// let k = 20;
// let z = 1; 

// for (let i = 0; i<n; i++) {
//     let arr = [];
//     for (let j = 0; j<m; j++) {
//         if (z*z<k) {
//             arr.push(z*z);
//             z++;
//         }
//         else {
//             break;
//         }

//     }
//     console.log(arr);
// }

let n = 2; 
let m = 3; 
let k = 20;
let z = 1; 

for (let i = 0; i<n; i++) {
    let arr = [];
    for (let j = 0; j < m; j++) {
        if(z*z<k) {
            arr.push(z*z);
            z+=1;
        }
        
    }
    if (arr.length === m){
        console.log(arr);

    }
    
}